# Merging DataFrames

In [2]:
import pandas as pd
df = pd.DataFrame([{'Name':'Kevin','Item_Purchased':'Chocolates','Cost':3.50},
                  {'Name':'Angela','Item_Purchased':'Kitty Litter','Cost':9.50},
                  {'Name':'Jim','Item_Purchased':'Ring','Cost':50.00}],
                 index=['Store 1','Store 1','Store 2'])
df

         Cost Item_Purchased    Name
Store 1   3.5     Chocolates   Kevin
Store 1   9.5   Kitty Litter  Angela
Store 2  50.0           Ring     Jim

In [4]:
df['Date'] = ['Dec 1', 'Jan 1','Mid May']
df

         Cost Item_Purchased    Name     Date
Store 1   3.5     Chocolates   Kevin    Dec 1
Store 1   9.5   Kitty Litter  Angela    Jan 1
Store 2  50.0           Ring     Jim  Mid May

In [5]:
df['Delivered']=True

In [6]:
df

         Cost Item_Purchased    Name     Date  Delivered
Store 1   3.5     Chocolates   Kevin    Dec 1       True
Store 1   9.5   Kitty Litter  Angela    Jan 1       True
Store 2  50.0           Ring     Jim  Mid May       True

In [7]:
df['FeedBack'] = ['Positive',None,'Negative']
df

         Cost Item_Purchased    Name     Date  Delivered  FeedBack
Store 1   3.5     Chocolates   Kevin    Dec 1       True  Positive
Store 1   9.5   Kitty Litter  Angela    Jan 1       True      None
Store 2  50.0           Ring     Jim  Mid May       True  Negative

In [8]:
adf = df.reset_index()
adf

     index  Cost Item_Purchased    Name     Date  Delivered  FeedBack
0  Store 1   3.5     Chocolates   Kevin    Dec 1       True  Positive
1  Store 1   9.5   Kitty Litter  Angela    Jan 1       True      None
2  Store 2  50.0           Ring     Jim  Mid May       True  Negative

In [21]:
adf['Date'] = pd.Series({0:'Dec 1',2:'Mid May'})
adf

     index  Cost Item_Purchased    Name     Date  Delivered  FeedBack
0  Store 1   3.5     Chocolates   Kevin    Dec 1       True  Positive
1  Store 1   9.5   Kitty Litter  Angela      NaN       True      None
2  Store 2  50.0           Ring     Jim  Mid May       True  Negative

## Merge DataFrames

In [23]:
staff_df = pd.DataFrame([{'Name':'Pam','Role':'Receptionist'},
                         {'Name':'Jim','Role':'Sales Man'},
                         {'Name':'Mike','Role':'Manager'}
                        ])
staff_df = staff_df.set_index('Name')

In [24]:
staff_df

              Role
Name
Pam   Receptionist
Jim      Sales Man
Mike       Manager

In [25]:
student_df = pd.DataFrame([{'Name':'Mike','School':'Business'},
                           {'Name':'Kevin','School':'Accounting'},
                           {'Name':'Jim','School':'Marketing'}
                          ])
student_df

    Name      School
0   Mike    Business
1  Kevin  Accounting
2    Jim   Marketing

In [27]:
student_df = student_df.set_index('Name')
student_df

           School
Name
Mike     Business
Kevin  Accounting
Jim     Marketing

In [28]:
pd.merge?

In [29]:
pd.merge(staff_df,student_df,how='outer',left_index=True,right_index=True)

               Role      School
Name
Jim       Sales Man   Marketing
Kevin           NaN  Accounting
Mike        Manager    Business
Pam    Receptionist         NaN

In [30]:
pd.merge(staff_df,student_df,how='inner',left_index=True,right_index=True)

           Role     School
Name
Jim   Sales Man  Marketing
Mike    Manager   Business

In [31]:
pd.merge(staff_df,student_df,how='left',left_index=True,right_index=True)

              Role     School
Name
Pam   Receptionist        NaN
Jim      Sales Man  Marketing
Mike       Manager   Business

In [32]:
pd.merge(staff_df,student_df,how='right',left_index=True,right_index=True)

            Role      School
Name
Mike     Manager    Business
Kevin        NaN  Accounting
Jim    Sales Man   Marketing